package main

import (
	"Wildberries/L2/patterns/structural/facade/calculator"
	"fmt"
)

func main() {
	expression := "20/2-(2+2*3)"
	//expression := "20/2-(2+2*3)" // 2
	//expression := "17+5*(4+8-7)*89/(5-9*8)" // −16,2089552239
	//expression := "((17+5*(4+(8-7))*89)/(5-9*8))" // −33,4626865672
	//expression := "121/(17/5-7)/12" // −2,80092592593
	//expression := "5*85.5" // 427.5
	//expression := "147*((58+45)/(78/45))*124/(121+56*8)" // 1903,62714614
	//expression := "(121/(17.5/5-7)/12.4)*(148-12.5)" // −377,776497696
	//expression := "(121/(17/(5-7/12)))+(148-12)" // 167,43627451
	//expression := "(121/(17/(5-7/12)))/(148/(12)*(121/(17.5/5-7)/12.4)*(148)-12.5)" // −0,00616208691
	c := calculator.NewCalculator()
	fmt.Println(c.Calculate(expression))

	// Don't support unary minus !
	// Support float value (like 1.01, not like 1,01)
}

/*
Фасад — это структурный паттерн, который предоставляет простой (но урезанный) интерфейс к сложной системе объектов, библиотеке или фреймворку.
+ Позволяет абстрогировать сложность реализации бизнес-логики посредством предоставдления простого интерфейса.
*/
